модуль Тур.Колекції

// Із https://docs.microsoft.com/en-us/dotnet/fsharp/tour
// Щоб дізнатися більше про кожну тему, перейдіть за посиланням вище
// Ви також можете знайти більше навчальних ресурсів за адресою https://fsharp.org/
// (лише англійською)

модуль Списки =

    /// Списки визначаються за допомогою [ ... ].  Це порожній список.
    нехай список1 = [ ]

    /// Це список із 3 елементів.  ';' використовується для розділення елементів на одній лінії.
    нехай список2 = [ 1; 2; 3 ]

    /// Ви також можете розділяти елементи, розміщуючи їх на окремих лініях.
    нехай список3 = [
        1
        2
        3
    ]

    /// Це список цілих чисел від 1 до 1000
    нехай списокЧисел = [ 1 .. 1000 ]

    /// Списки також можуть бути створені шляхом обчислень. Це список,
    /// що містить усі дні року.
    нехай списокДнів =
        [ для місяць у 1 .. 12 зробити
              для день у 1 .. System.DateTime.DaysInMonth(2017, місяць) зробити
                  поступатися System.DateTime(2017, місяць, день) ]

    // Надрукуйте перші 5 елементів 'списокДнів' за допомогою 'List.take'.
    printfn "Перші 5 днів 2017 року: %A" (списокДнів |> List.take 5)

    /// Обчислення можуть містити умови.  Це список, що містить кортежі,
    /// які є координатами чорних квадратів на шахівниці.
    нехай чорніКвадрати =
        [ для i у 0 .. 7 зробити
              для j у 0 .. 7 зробити
                  якщо (i+j) % 2 = 1 тоді
                      поступатися (i, j) ]

    /// Списки можна трансформувати за допомогою 'List.map' та інших комбінаторів функціонального програмування.
    /// Це визначення створює новий список шляхом зведення чисел із numberList у квадрат, використовуючи
    /// оператор конвеєра для передачі аргументу List.map.
    нехай квадрати =
        списокЧисел
        |> List.map (фун x -> x*x)

    /// Є багато інших комбінацій списків. Далі обчислюється сума квадратів чисел,
    /// які діляться на 3.
    нехай сумаКвадратів =
        списокЧисел
        |> List.filter (фун x -> x % 3 = 0)
        |> List.sumBy (фун x -> x * x)

    printfn "Сума квадратів чисел до 1000, які діляться на 3, дорівнює: %d" сумаКвадратів


модуль Массиви =

    /// Це порожній масив.  Зауважте, що синтаксис подібний до Cписків, але використовує `[| ... |]` замість `[ ... ]`.
    нехай масив1 = [| |]

    /// Масиви вказуються за допомогою того самого списку конструкцій, що й списки.
    нехай масив2 = [| "привіт"; "світ"; "та"; "привіт"; "світ"; "знову" |]

    /// Це масив чисел від 1 до 1000.
    нехай масив3 = [| 1 .. 1000 |]

    /// Це масив, що містить лише слова "привіт" та "світ".
    нехай масив4 =
        [| для слово у масив2 зробити
               якщо слово.Contains("і") тоді
                   поступатися слово |]

    /// Це масив, ініціалізований індексом і містить парні числа від 0 до 2000.
    нехай парніЧисла = Array.init 1001 (фун n -> n * 2)

    /// Підмасиви витягуються за допомогою нотації зрізу.
    нехай зрізПарнихЧисел = парніЧисла.[0..500]

    // Ви можете перебирати масиви та списки за допомогою циклів 'для'.
    для слово у масив4 зробити
        printfn "слово: %s" слово

    // Ви можете змінити вміст елемента масиву за допомогою оператора призначення стрілка вліво.
    //
    // Щоб дізнатися більше про цього оператора, дивиться: https://docs.microsoft.com/dotnet/fsharp/language-reference/values/index#змінливий-variables
    масив2.[1] <- "WORLD!"

    /// You can transform arrays using 'Array.map' and other functional programming operations.
    /// The following calculates the sum з the lengths з the words that start із 'п'.
    нехай сумаДовжинСлів =
        масив2
        |> Array.filter (фун x -> x.StartsWith "п")
        |> Array.sumBy (фун x -> x.Length)

    printfn "Сума довжин слів у масиві 2 дорівнює: %d" сумаДовжинСлів


модуль Послідовності =

    /// Це порожня послідовність.
    нехай посл1 = Seq.empty

    /// This a sequence з values.
    нехай посл2 = seq { поступатися "привіт"; поступатися "світ"; поступатися "та"; поступатися "привіт"; поступатися "світ"; поступатися "знову" }

    /// Це послідовність по запиту від 1 до 1000.
    нехай числоваПосл = seq { 1 .. 1000 }

    /// Це послідовність що створює слова "привіт" та "світ"
    нехай посл =
        seq { для слово у посл2 зробити
                  якщо слово.Contains("і") тоді
                      поступатися слово }

    /// Ця послідовність створює парні числа до 2000.
    нехай evenNumbers = Seq.init 1001 (фун n -> n * 2)

    нехай випадк = System.Random()

    /// Це нескінченна послідовність, яка є випадковим блуканням.
    /// У цьому прикладі використовується yield! щоб повернути кожен елемент підпослідовності.
    нехай rec випадковеБлукання x =
        seq { поступатися x
              yield! випадковеБлукання (x + випадк.NextDouble() - 0.5) }

    /// У цьому прикладі показано перші 100 елементів випадкового блукання.
    нехай перші100ЗначеньВипадковогоБлукання =
        випадковеБлукання 5.0
        |> Seq.truncate 100
        |> Seq.toList

    printfn "Перші 100 елементів випадкового блукання: %A" перші100ЗначеньВипадковогоБлукання
