модуль Тур.Об'еднання

// Із https://docs.microsoft.com/en-us/dotnet/fsharp/tour
// Щоб дізнатися більше про кожну тему, перейдіть за посиланням вище
// Ви також можете знайти більше навчальних ресурсів за адресою https://fsharp.org/
// (лише англійською)

модуль РозділяючіОб'еднання =

    /// Тип нижче представляє масть гральної карти.
    тип Масть =
        | Чирва
        | Піка
        | Бубна
        | Трефа

    /// Розділяючі Об'еднання може бути використовано для ранга карти A Discriminated Union can also be used to represent the rank з a playing card.
    тип Ранг =
        /// Представляє усі ранги карт від 2 до 10
        | Значення з int
        | Туз
        | Король
        | Дама
        | Валет

        /// Розділяючі Об'еднання також можуть реалізовувати об'єктно орієнтовні члени.
        статичний член ВзятиУсіРанги() =
            [ поступатися Туз
              для i у 2 .. 10 зробити поступатися Значення i
              поступатися Валет
              поступатися Дама
              поступатися Король ]

    /// Це тип запису який комбінує Масть і Ранг.
    /// Це дуже типово використовувати як Записи так і Розділяючиоб'еднання коли моделюєш дані.
    тип Карта = { Масть: Масть; Ранг: Ранг }

    /// Ця декларація обчислить список представляючий усі карти у колоді.
    нехай повнаКолода =
        [ для масть у [ Чирва; Бубна; Піка; Трефа] зробити
              для ранг у Ранг.ВзятиУсіРанги() зробити
                  поступатися { Масть=масть; Ранг=ранг } ]

    /// Цей приклад конвертує об'єкт 'Карта' до рядка.
    нехай показатиГральнуКарту (к: Карта) =
        нехай рядокРанга =
            співстав к.Ранг із
            | Туз -> "Туз"
            | Король -> "Король"
            | Дама -> "Дама"
            | Валет -> "Валет"
            | Значення ч -> string ч
        нехай рядокМасті =
            співстав к.Масть із
            | Піка -> "пік"
            | Бубна -> "бубен"
            | Трефа -> "треф"
            | Чирва -> "чирвей"
        рядокРанга  + " " + рядокМасті

    /// Цей приклад надрукує усі карти у гральній колоді.
    нехай надрукуватиУсіКарти() =
        для карта у повнаКолода зробити
            printfn "%s" (показатиГральнуКарту карта)


    // РО із одиничним варіантом часто використовуюється для моделювання зон контролю(domain modelling). Це може дати вам додаткову This can buy you extra тип safety
    // безпеку типів над примітивними типами такими як рядки або цілі.
    //
    // РО із одиничним варіантом не можуть неявно конвертуватися у, або із типу який вони огортають.
    // Наприклад, фцнкція яка приймає Адреса не може прийняти рядок як вхідні дані,
    // або навпаки.
    тип Адреса = Адреса з string
    тип Ім'я = Ім'я з string
    тип ІІН = ІІН з int

    // Ви можете легко створити екземпляр РО із одиничним варіантом наступним чином.
    нехай адреса = Адреса "111 Alf Way"
    нехай ім'я = Ім'я "Alf"
    нехай іін = ІІН 1234567890

    /// Коли вам потрібно значення, ви можете розгорнути значення що лежить у основі за допомогою простої функції.
    нехай розгорнутиАдресу (Адреса а) = а
    нехай розгорнутиІм'я (Ім'я і) = і
    нехай розгорнутиІІН (ІІН с) = с

    // Друкування РО із одиничним варіантом це просто із допомогою розгортаючих функцій.
    printfn "Адреса: %s, Ім'я: %s та ІІН: %d" (адреса |> розгорнутиАдресу) (ім'я |> розгорнутиІм'я) (іін |> розгорнутиІІН)


    /// Розділяючи Об'єднання також підтримують рекурсивні визначення.
    ///
    /// Цей тип представляє Бінарне Дерево Пошуку, із одним варіантом Пусте дерево,
    /// та іншим варіантом Вузел із значенням і двома піддеревами.
    тип БДП<'Т> =
        | Пусте
        | Вузел з значення:'Т * лівий: БДП<'Т> * правий: БДП<'Т>

    /// Перевіряє чи існує елементі у бінарному дереві пошука.
    /// Шукає рекурсивно використовуючи Відповідність Шаблону.  Повертає істина якщо він існіє; інакше, лож.
    нехай rec існує елемент бпд =
        співстав бпд із
        | Пусте -> false
        | Вузел (значення, ліве, праве) ->
            якщо елемент = значення тоді true
            інякщо елемент < значення тоді (існує елемент ліве) // Перевірити ліве піддерево.
            інакше (існує елемент праве) // Перевірити праве піддерево.

    /// Вставляє елемент у Бінарне Дерево Пошуку.
    /// Знаходить місце для вставки рекурсивно використовуючи Відповідність Шаблону, потім вставляє новий вузел.
    /// Якщо елемент вже існує, функція не вставляє нічого.
    нехай rec вставити елемент бдп =
        співстав бдп із
        | Пусте -> Вузел(елемент, Пусте, Пусте)
        | Вузел(значення, ліве, праве) as вузел ->
            якщо елемент = значення тоді вузел // Не треба вставляти, він вже існує; повернути вузел.
            інякщо елемент < значення тоді Вузел(значення, вставити елемент ліве, праве) // Викликати у ліве піддерево.
            інакше Вузел(значення, ліве, вставити елемент праве) // Викликати у праве піддерево.


модуль ВідповідністьШаблону =
    відкрити System

    /// Запис для ім'я так фамілії людини
    тип Людина = {
        Ім'я : string
        Фамілія  : string
    }

    /// Розділяюче Об'єднання трьох різних видів співробітників
    тип Співробітник =
        | Інжинер з інжинер: Людина
        | Керівник з керівник: Людина * підлеглі: List<Співробітник>
        | Виконавчий з виконавчий: Людина * підлеглі: List<Співробітник> * помічник: Співробітник

    /// Підраховує усіх під співробітником у ієрархії керування,
    /// включючи співробітника. Співставлення зв'язує імена із властивостями
    /// варіантів таким чином щоб ці імена можна було використовувати всередині гілок співставлення.
    /// Зауважте що імені використані при зв'язуванні не повинні бути тими самими іменами яка були
    /// дані у визначенні РО вищче.
    нехай rec підрахуватиПідлеглих(спів : Співробітник) =
        1 + співстав спів із
            | Інжинер(людина) ->
                0
            | Керівник(людина, підлеглі) ->
                підлеглі |> List.sumBy підрахуватиПідлеглих
            | Виконавчий(людина, підлеглі, помічник) ->
                (підлеглі |> List.sumBy підрахуватиПідлеглих) + підрахуватиПідлеглих помічник


    /// Знайти усіх менеджерів/виконавчих із ім'ям "Богдан" у яких немає ніяких підлеглих.
    /// Приклад використовує скорочення 'функція' для лямбда виразу.
    нехай rec знайтиБогданаІзВідкритимиПозіціями(спів : List<Співробітник>) =
        спів
        |> List.filter(функція
                       | Керівник({Ім'я = "Богдан"}, []) -> true // [] співставляє пустий список.
                       | Виконавчий({Ім'я = "Богдан"}, [], _) -> true
                       | _ -> false) // '_' це шаблон підстановки який співставляє будь-що.
                                     // Він обробляє випадок "інакше".


    /// You can also use the shorthand функція construct для pattern matching,
    /// which is useful when you're writing functions which make use з Partial Application.
    нехай приватний помічникРозбору ф = ф >> функція
        | (true, елемент) -> Some елемент
        | (false, _) -> None

    нехай розібратиДатуЧасСдвиг: string -> _ = помічникРозбору DateTimeOffset.TryParse

    нехай результат = розібратиДатуЧасСдвиг "1970-01-01"
    співстав результат із
    | Some опд -> printfn "Воно розібралося!"
    | None -> printfn "Воно не розібралося!"

    // Визначемо більше функції які розбирають за допомогою вспоміжної функції.
    нехай розібратиЦіл: string -> _  = помічникРозбору Int32.TryParse
    нехай розібратиДвойне: string -> _  = помічникРозбору Double.TryParse
    нехай розібратиВідрізокЧасу: string -> _  = помічникРозбору TimeSpan.TryParse


    // Активні Шаблони це інша потужна конструкія для використання із відповідністю шаблону.
    // Вони дозволяють вам розділяти вхідні дані на довільні форми, декомпозуючи їх у місці виклику відповідності шаблону.
    //
    // Щоб дізнатися більше, дивиться: https://docs.microsoft.com/dotnet/fsharp/language-reference/active-patterns
    // (лише англійською)
    нехай (|Ціл|_|) = розібратиЦіл
    нехай (|Двойне|_|) = розібратиДвойне
    нехай (|Дата|_|) = розібратиДатуЧасСдвиг
    нехай (|ВідрізокЧасу|_|) = розібратиВідрізокЧасу

    /// Відповідність Шаблону через ключове слово 'функція' та Активні Шаблони зазвичай виглядає так.
    нехай надрукуватиРезультатРозбору = функція
        | Ціл значення -> printfn "%d" значення
        | Двойне значення -> printfn "%f" значення
        | Дата д -> printfn "%s" (д.ToString())
        | ВідрізокЧасу ч -> printfn "%s" (ч.ToString())
        | _ -> printfn "Нічого що можна розібрати!"

    // Викликає друкувальника із деякими різними значеннями для розбору.
    надрукуватиРезультатРозбору "12"
    надрукуватиРезультатРозбору "12.045"
    надрукуватиРезультатРозбору "12/28/2016"
    надрукуватиРезультатРозбору "9:01PM"
    надрукуватиРезультатРозбору "banana!"


модуль ОпціональніЗначення =
    /// Опціональні значення це будь які значення помічені або 'Some' або 'None'.
    /// Вони широко використовуються у F# коді для того щоб представляти варіанти де багато інших мов би використовували
    /// посилання на нулл.
    ///
    /// Щоб дізнатися більше, дивиться: https://docs.microsoft.com/dotnet/fsharp/language-reference/options
    /// (лише англійською)

    /// Спочатку, визначемо індекс як Розподіляюче Об'єднання із Одним Варіантом.
    тип Індекс = Індекс з string

    /// Далі, визначемо тип деІндекс є необов'язковим.
    тип Клієнт = { Індекс: Індекс option }

    /// Далі, визначемо тип інтерфейсу який представляє об'єкт для обчислення зони доставки за індексом клієнта,
    /// маючи реалізаціі для абстрактних методів 'getState' та 'getShippingZone' абстрактний methods.
    тип ІКалькуляторДоставки =
        абстрактний ВзятиОбласть : Індекс -> string option
        абстрактний ВзятиЗонуДоставки : string -> int

    /// Далі, розрахуємо зону доставки для клієнта використовуючи екземпляр калькулятора.
    /// Це приклад використовує комбінатори у модуля Option щоб забезпечити функціональний конвеєр для
    /// трансформації даних із Опціоналами.
    нехай ЗонаДоставкиКлієнта (калькулятор: ІКалькуляторДоставки, клієнт: Клієнт) =
        клієнт.Індекс
        |> Option.bind калькулятор.ВзятиОбласть
        |> Option.map калькулятор.ВзятиЗонуДоставки
