модуль Tour.UnitsOfMeasure

// Із https://docs.microsoft.com/en-us/dotnet/fsharp/tour
// Щоб дізнатися більше про кожну тему, перейдіть за посиланням вище
// Ви також можете знайти більше навчальних ресурсів за адресою https://fsharp.org/
// (лише англійською)

// Одиниці виміру це шлях анотації примітивних числових типів у типо безпечний шлях.
// Ви можете виконувати типобезпечну аріфметику на цих значеннях.
//
// Щоб дізнатися більше, дивіться: https://docs.microsoft.com/dotnet/fsharp/language-reference/units-з-measure

// Спочатку, відкрийте колекцію загальні назв одиниць виміру
відкрити Microsoft.FSharp.Data.UnitSystems.SI.UnitNames

/// Визначте вимірну константу
нехай прикладЗначення1 = 1600.0<meter>

/// Далі, визначте новий тип одиниці виміру
[<Measure>]
тип міля =
    /// Коефіцієнт конверсії милі до метрів.
    статичний член якМетр = 1609.34<meter/міля>

/// Визначте вимірну константу
нехай прикладЗначення2 = 500.0<міля>

/// Розрахуйте метрічну константу
нехай прикладЗначення3 = прикладЗначення2 * міля.якМетр

// Значення використовуючи Одиниці Виміру можуть бути використовані так само як і примітивні числові типи для таких речей як друкування.
printfn "Після гонки на %f метрів я пройду %f миль що буде дорівнювати %f метрам" прикладЗначення1 прикладЗначення2 прикладЗначення3
