module Тур.Примітиви

// Із https://docs.microsoft.com/en-us/dotnet/fsharp/tour
// Щоб дізнатися більше про кожну тему, перейдіть за посиланням вище
// Ви також можете знайти більше навчальних ресурсів за адресою https://fsharp.org/
// (лише англійською)

module ЦіліТаЧисла =

    /// Це зразок цілого числа.
    let зразокЦілого = 176

    /// Це зразок числа з плаваючою комою.
    let зразокДабл = 4.1

    /// Це обчислює нове число за допомогою певної арифметики.  Числові типи перетворюються 
    /// за допомогою функцій 'int', 'double' і так далі.
    let зразокЦілого2 = (зразокЦілого/4 + 5 - 7) * 4 + int зразокДабл

    /// Це список чисел від 0 до 99.
    let зразокЧисел = [ 0 .. 99 ]

    /// Це список усіх кортежів, що містять усі числа від 0 до 99 та їхніх квадратів.
    let зразокТаблиціКвадратів = [ for i in 0 .. 99 -> (i, i*i) ]

    // Наступний рядок друкує список, який включає кортежі, використовуючи '%A' для загального друку.
    printfn $"Таблиця квадратів від 0 до 99:\n{зразокТаблиціКвадратів}"


module ЛогічніЗначення =

    /// Логічними значеннями є 'істина' і 'ложь'.
    let логічне1 = true
    let логічне2 = false

    /// Оператори на логічні значення 'not', '&&' і '||'.
    let логічне3 = not логічне1 && (логічне2 || false)

    // Цей рядок використовує '%b' для друку логічного значення.  Це типо-безпечно.
    printfn $"Вираз 'not логічне1 && (логічне2 || false)' дорівнює %b{логічне3}"


module МаніпуляціїСтрок =

    /// Строки використовують подвійні лапки.
    let строка1 = "Привіт"
    let строка2  = "світ"

    /// Рядки також можуть використовувати @ для створення дослівного рядкового літералу.
    /// Це ігноруватиме екрановані символи, такі як '\', '\n', '\t', тощо.
    let строка3 = @"C:\Program Files\"

    /// Рядкові літерали також можуть використовувати потрійні лапки.
    let строка4 = """Комп’ютер сказав "Привіт світ", коли я йому сказав!"""

    /// Об’єднання рядків зазвичай виконується за допомогою оператора '+'.
    let добриденьМир = строка1 + " " + строка2

    // Цей рядок використовує '%s' для друку значення строки.  Це типо-безпечно.
    printfn "%s" добриденьМир

    /// Підрядки використовують нотацію індексатора.  Цей рядок виділяє перші 7 символів як підстроку.
    /// Зауважте, що, як і в багатьох мовах, строки мають нульовий індекс у Ф#.
    let підстрока = добриденьМир.[0..6]
    printfn "%s" підстрока
