модуль Таблиця

// Build your own Excel 365 у an hour із F# by Tomas Petricek!
// Watch the video з the talk here: https://www.youtube.com/watch?v=Bnm71YEt_lI

модуль Elmish =

    відкрити System
    відкрити Fable.Core
    відкрити Browser
    відкрити Browser.Types

    // ------------------------------------------------------------------------------------------------
    // Virtual Dom bindings
    // ------------------------------------------------------------------------------------------------

    тип IVirtualdom =
        абстрактний h: arg1: string * arg2: obj * arg3: obj[] -> obj
        абстрактний diff: tree1:obj * tree2:obj -> obj
        абстрактний patch: node:obj * patches:obj -> Node
        абстрактний create: e:obj -> Node

    [<Global("virtualDom")>]
    нехай Virtualdom: IVirtualdom = jsNative

    // ------------------------------------------------------------------------------------------------
    // F# representation з DOM and rendering using VirtualDom
    // ------------------------------------------------------------------------------------------------

    тип АтрібутДом =
        | ОбробникПодій з (Event -> unit)
        | Атрібут з string
        | Властивість з string

    тип ВузелДом =
        | Текст з string
        | Елемент з тег:string * атрібути:(string * АтрібутДом)[] * діти : ВузелДом[]

    нехай створитиДерево тег арги діти =
        нехай атріби = ResizeArray<_>()
        нехай властив = ResizeArray<_>()
        для к, зн у арги зробити
            співстав к, зн із
            | "style", Атрібут зн
            | "style", Властивість зн ->
                    нехай args = зн.Split(';') |> Array.map (фун а ->
                        нехай sep = а.IndexOf(':')
                        якщо sep > 0 тоді а.Substring(0, sep), box (а.Substring(sep+1))
                        інакше а, box "" )
                    властив.Add ("style", JsInterop.createObj args)
            | "class", Атрібут зн
            | "class", Властивість зн ->
                    атріби.Add (к, box зн)
            | к, Атрібут зн ->
                    атріби.Add (к, box зн)
            | к, Властивість зн ->
                    властив.Add (к, box зн)
            | к, ОбробникПодій ф ->
                    властив.Add (к, box ф)
        нехай атріби = JsInterop.createObj атріби
        нехай властив = JsInterop.createObj (Seq.append ["attributes", атріби] властив)
        нехай елем = Virtualdom.h(тег, властив, діти)
        елем

    нехай rec відобразити вузел =
        співстав вузел із
        | Текст(с) ->
                box с
        | Елемент(tag, attrs, children) ->
                створитиДерево tag attrs (Array.map відобразити children)

    // ------------------------------------------------------------------------------------------------
    // Helpers для dynamic property access & для creating HTML elements
    // ------------------------------------------------------------------------------------------------

    тип Dynamic() =
        [<Emit("$0[$1]")>]
        статичний член (?) (d:Dynamic, s:string) : Dynamic = jsNative

    нехай текст s = Текст(s)
    нехай (=>) k v = k, Властивість(v)
    нехай (=!>) k f = k, ОбробникПодій(фун e -> f e)

    тип El() =
        статичний член (?) (_:El, n:string) = фун a b ->
            Елемент(n, Array.ofList a, Array.ofList b)

    нехай h = El()

    // ------------------------------------------------------------------------------------------------
    // Entry point - create event and update on trigger
    // ------------------------------------------------------------------------------------------------

    тип Кмд<'Msg> = (('Msg -> unit) -> unit) list

    тип SingleObservable<'T>() =
        нехай змінливий слухач: IObserver<'T> option = None
        член _.Trigger v =
            співстав слухач із
            | Some слух -> слух.OnNext v
            | None -> ()
        інтерфейс IObservable<'T> із
            член _.Subscribe w =
                слухач <- Some w
                { новий IDisposable із
                    член _.Dispose() = () }

    нехай апка ід (ініц: unit -> 'Model * Кмд<'Msg>) оновити відображення =
        нехай подія = новий Event<'Msg>()
        нехай гачок e = подія.Trigger(e)
        нехай модель, кмди = ініц()
        нехай змінливий стан = модель
        нехай змінливий дерево = відображення стан гачок |> відобразити
        нехай змінливий контейнер = Virtualdom.create(дерево)
        document.getElementById(ід).appendChild(контейнер) |> ignore

        нехай обробитиПодію под =
            нехай модель, кмди = оновити под стан
            нехай новеДерево = відображення модель гачок |> відобразити
            нехай латки = Virtualdom.diff(дерево, новеДерево)
            контейнер <- Virtualdom.patch(контейнер, латки)
            дерево <- новеДерево
            стан <- модель
            для кмд у кмди зробити
                кмд гачок

        подія.Publish.Add(обробитиПодію)
        для кмд у кмди зробити
            кмд гачок

модуль Парсек =
    тип ПотікПарсеру<'T> = int * list<'T>
    тип Парсер<'T, 'R> = Парсер з (ПотікПарсеру<'T> -> option<ПотікПарсеру<'T> * 'R>)

    /// Returned by the `slot` функція to create a parser slot that is filled later
    тип ВстановлювачПарсеру<'T, 'R> =
      { Set : Парсер<'T, 'R> -> unit }

    /// Ignore the result з the parser
    нехай ігнорувати (Парсер п) = Парсер(фун вхід ->
      п вхід |> Option.map (фун (i, r) -> i, ()))

    /// Creates a delayed parser whose actual parser is set later
    нехай слот () =
      нехай змінливий слот = None
      { Set = фун (Парсер p) -> слот <- Some p },
      Парсер(фун вхід ->
        співстав слот із
        | Some слот -> слот вхід
        | None -> failwith "Slot not initialized")

    /// If the input matches the specified prefix, produce the specified result
    нехай префікс (префікс:list<'C>) result = Парсер(фун (offset, вхід) ->
      нехай rec цикл (word:list<'C>) вхід =
        співстав word, вхід із
        | c::word, i::вхід when c = i -> цикл word вхід
        | [], input -> Some(input)
        | _ -> None

      співстав цикл префікс вхід із
      | Some(вхід) -> Some((offset+List.length префікс, вхід), result)
      | _ -> None)

    /// Parser that succeeds when either з the two arguments succeed
    нехай (<|>) (Парсер p1) (Парсер p2) = Парсер(фун вхід ->
      співстав p1 вхід із
      | Some(вхід, рез) -> Some(вхід, рез)
      | _ -> p2 вхід)

    /// Run two parsers у sequence and повернути the result as a tuple
    нехай (<*>) (Парсер p1) (Парсер p2) = Парсер(фун input ->
      співстав p1 input із
      | Some(input, res1) ->
          співстав p2 input із
          | Some(input, res2) -> Some(input, (res1, res2))
          | _ -> None
      | _ -> None)

    /// Transforms the result з the parser using the specified функція
    нехай map f (Парсер p) = Парсер(фун input ->
      p input |> Option.map (фун (input, res) -> input, f res))

    /// Run two parsers у sequence and повернути the result з the second one
    нехай (<*>>) p1 p2 = p1 <*> p2 |> map snd

    /// Run two parsers у sequence and повернути the result з the first one
    нехай (<<*>) p1 p2 = p1 <*> p2 |> map fst

    /// Succeed without consuming input
    нехай unit res = Парсер(фун input -> Some(input, res))

    /// Parse using the first parser and тоді call a функція to produce
    /// next parser and parse the rest з the input із the next parser
    нехай зв'язати f (Парсер p) = Парсер(фун input ->
      співстав p input із
      | Some(input, res) ->
          нехай (Парсер g) = f res
          співстав g input із
          | Some(input, res) -> Some(input, res)
          | _ -> None
      | _ -> None)

    /// Parser that tries to use a specified parser, but returns None якщо it fails
    нехай опціонально (Парсер п) = Парсер(фун вхід ->
      співстав п вхід із
      | None -> Some(вхід, None)
      | Some(input, res) -> Some(input, Some res) )

    /// Parser that succeeds якщо the input matches a predicate
    нехай пред п = Парсер(функція
      | offs, c::input when п c -> Some((offs+1, input), c)
      | _ -> None)

    /// Parser that succeeds якщо the predicate returns Some value
    нехай вибір п = Парсер(функція
      | offs, c::input -> п c |> Option.map (фун c -> (offs + 1, input), c)
      | _ -> None)

    /// Parse zero or more repetitions using the specified parser
    нехай нульАбоБільше (Парсер п) =
      нехай rec loop acc input =
        співстав п input із
        | Some(input, res) -> loop (res::acc) input
        | _ -> Some(input, List.rev acc)
      Парсер(loop [])

    /// Parse one or more repetitions using the specified parser
    нехай одинАбоБільше п =
      (п <*> (нульАбоБільше п))
      |> map (фун (c, cs) -> c::cs)


    нехай будьЯкийПробіл = нульАбоБільше (пред (фун t -> t = ' '))

    нехай символ ток = пред (фун t -> t = ток)

    нехай розділений роз п =
      п <*> нульАбоБільше (роз <*> п)
      |> map (фун (a1, args) -> a1::(List.map snd args))

    нехай розділенийПотім роз п1 п2 =
      п1 <*> нульАбоБільше (роз <*> п2)
      |> map (фун (a1, args) -> a1::(List.map snd args))

    нехай розділенийАбоПустий роз п =
      опціонально (розділений роз п)
      |> map (фун l -> defaultArg l [])

    нехай цифра = пред (фун t -> t <= '9' && t >= '0')

    нехай ціле = одинАбоБільше цифра |> map (фун nums ->
      nums |> List.fold (фун res n -> res * 10 + (int n - int '0')) 0)

    нехай літера = пред (фун t ->
      (t <= 'Z' && t >= 'A') || (t <= 'z' && t >= 'a'))

    нехай запустити (Парсер(f)) вхід =
      співстав f (0, List.ofSeq вхід) із
      | Some((i, _), рез) when i = Seq.length вхід -> Some рез
      | _ -> None

модуль Обчислювач =
    відкрити Парсек

    // ----------------------------------------------------------------------------
    // DOMAIN MODEL
    // ----------------------------------------------------------------------------

    тип Позиція = char * int

    тип Вираз =
      | Посилання з Позиція
      | Число з int
      | Бінарна з Вираз * char * Вираз

    // ----------------------------------------------------------------------------
    // Парсер
    // ----------------------------------------------------------------------------

    // Basics: operators (+, -, *, /), cell reference (e.g. A10), number (e.g. 123)
    нехай оператор = символ '+' <|> символ '-' <|> символ '*' <|> символ '/'
    нехай посилання = літера <*> ціле |> map Посилання
    нехай число = ціле |> map Число

    // Nested operator uses need to be parethesized, для example (1 + (3 * 4)).
    // <expr> is a binary operator without parentheses, number, reference or
    // nested brackets, while <term> is always bracketed or primitive. We need
    // to use `expr` recursively, which is handled via змінливий slots.
    нехай встановлювачВираз, вираз = слот ()
    нехай дужк = символ '(' <*>> будьЯкийПробіл <*>> вираз <<*> будьЯкийПробіл <<*> символ ')'
    нехай терм = число <|> посилання <|> дужк
    нехай бінарний = терм <<*> будьЯкийПробіл <*> оператор <<*> будьЯкийПробіл <*> терм |> map (фун ((л,оп), п) -> Бінарна(л, оп, п))
    нехай виразВспом = бінарний <|> терм
    встановлювачВираз.Set виразВспом

    // Formula starts із `=` followed by expression
    // Equation you can write у a cell is either number or a formula
    нехай формула = символ '=' <*>> будьЯкийПробіл <*>> вираз
    нехай рівняння = будьЯкийПробіл <*>> (формула <|> число) <<*> будьЯкийПробіл

    // Run the parser on a given input
    нехай розібрати вхід = запустити рівняння вхід

    // ----------------------------------------------------------------------------
    // обчилювач
    // ----------------------------------------------------------------------------

    нехай rec обчислити пройдене (комірки:Map<Позиція, string>) вираз =
      співстав вираз із
      | Число чис ->
          Some чис

      | Бінарна(л, оп, п) ->
          нехай ops = dict [ '+', (+); '-', (-); '*', (*); '/', (/) ]
          обчислити пройдене комірки л |> Option.bind (фун л ->
            обчислити пройдене комірки п |> Option.map (фун п ->
              ops.[оп] л п ))

      | Посилання поз when Set.contains поз пройдене ->
          None

      | Посилання поз ->
          комірки.TryFind поз |> Option.bind (фун value ->
            розібрати value |> Option.bind (фун розібране ->
              обчислити (Set.add поз пройдене) комірки розібране))

відкрити Elmish
відкрити Обчислювач

// ----------------------------------------------------------------------------
// Домена модель
// ----------------------------------------------------------------------------

тип Подія =
  | ОновитиЗначення з Позиція * string
  | ПочатокРедагування з Позиція

тип Стан =
  { Рядки : int list
    ЄАктивним : Позиція option
    Стовпчики : char list
    Комірки : Map<Позиція, string> }

тип Переміщення =
    | ПереміститиВ з Позиція
    | Некоректне

тип Напрямок = Вверх | Вниз | Вліво | Вправо

нехай КнопкиНапрямку : Map<string, Напрямок> = Map.ofList [
  ("ArrowLeft", Вліво)
  ("ArrowUp", Вверх)
  ("ArrowRight", Вправо)
  ("ArrowDown", Вниз)
]

// ----------------------------------------------------------------------------
// обробка подій
// ----------------------------------------------------------------------------

нехай оновлення пов стан =
  співстав пов із
  | ПочатокРедагування(поз) ->
      { стан із ЄАктивним = Some поз }, []

  | ОновитиЗначення(поз, значення) ->
      нехай новіКомірки =
          якщо значення = ""
              тоді Map.remove поз стан.Комірки
              інакше Map.add поз значення стан.Комірки
      { стан із Комірки = новіКомірки }, []

// ----------------------------------------------------------------------------
// відображення
// ----------------------------------------------------------------------------

нехай взятиНапрямок (ke: Browser.Types.KeyboardEvent) : Option<Напрямок> =
    Map.tryFind ke.key КнопкиНапрямку

нехай взятиПозицію ((стов, ряд): Позиція) (напрямок: Напрямок) : Позиція =
    співстав напрямок із
    | Вверх -> (стов, ряд - 1)
    | Вниз -> (стов, ряд + 1)
    | Вліво -> (char((int стов) - 1), ряд)
    | Вправо -> (char((int стов) + 1), ряд)

нехай взятиПереміщення (стан: Стан) (напрямок: Напрямок) : Переміщення =
    співстав стан.ЄАктивним із
    | None -> Некоректне
    | (Some позиція) ->
        нехай (стов, ряд) = взятиПозицію позиція напрямок
        якщо List.contains стов стан.Стовпчики && List.contains ряд стан.Рядки
            тоді ПереміститиВ (стов, ряд)
            інакше Некоректне

нехай взятиПодіюНатисканняКнопки стан гачок = фун (ke: Browser.Types.Event) ->
    співстав взятиНапрямок (ke :?> _) із
    | None -> ()
    | Some напрямок ->
        співстав взятиПереміщення стан напрямок із
        | Некоректне -> ()
        | ПереміститиВ позиція -> гачок(ПочатокРедагування(позиція))

нехай відмалюватиРедактор (гачок:Подія -> unit) поз стан значення =
  h?td [ "class" => "selected" ] [
    h?input [
      "autofocus" => "true"
      "onkeydown" =!> (взятиПодіюНатисканняКнопки стан гачок)
      "oninput" =!> (фун e -> гачок (ОновитиЗначення (поз, (e.target :?> Browser.Types.HTMLInputElement).value)))
      "value" => значення ] []
  ]

нехай відмалюватиВідображення гачок поз (значення:option<_>) =
  h?td
    [ "style" => (якщо значення.IsNone тоді "background:#ffb0b0" інакше "background:white")
      "onclick" =!> (фун _ -> гачок(ПочатокРедагування(поз)) ) ]
    [ Текст (Option.defaultValue "#ERR" значення) ]

нехай відмалюватиКомірку гачок поз стан =
  нехай значення = Map.tryFind поз стан.Комірки
  якщо стан.ЄАктивним = Some поз тоді
    відмалюватиРедактор гачок поз стан (Option.defaultValue "" значення)
  інакше
    нехай значення =
      співстав значення із
      | Some значення ->
          розібрати значення |> Option.bind (обчислити Set.empty стан.Комірки) |> Option.map string
      | _ -> Some ""
    відмалюватиВідображення гачок поз значення

нехай відображення стан гачок =
  нехай пусті = h?td [] []
  нехай заголовок htext = h?th [] [Текст htext]
  нехай заголовки = стан.Стовпчики |> List.map (фун заг -> заголовок (string заг))
  нехай заголовки = пусті::заголовки

  нехай комірки н =
    нехай комірки = стан.Стовпчики |> List.map (фун заг -> відмалюватиКомірку гачок (заг, н) стан)
    заголовок (string н) :: комірки
  нехай рядки = стан.Рядки |> List.map (фун р -> h?tr [] (комірки р))

  h?table [] [
    h?tr [] заголовки
    h?tbody [] рядки
  ]

// ----------------------------------------------------------------------------
// точка входу
// ----------------------------------------------------------------------------

нехай початкові () =
  { Стовпчики = ['A' .. 'K']
    Рядки = [1 .. 15]
    ЄАктивним = None
    Комірки = Map.empty },
  []

апка "main" початкові оновлення відображення
